class TamaraTerms {
  static const String terms = '''١.١ تشكل هذه الشروط والأحكام اتفاقية مُلزِمَة نظامًا بينك (إما شخصيًا أو نيابة عن كيان تمثلونه) وشركة نخلة لتقنية نظم المعلومات ذ.م.م. ("تمارا")، ويشار إليها فيما يلي باسم "نحن"، فيما يتعلق بجميع جوانب خدمات تمارا و/أو استخدامك لتطبيق الجوال أو وصولك إلى موقعنا على الويب، بالإضافة إلى أي قناة وسائط أو موقع ويب أو تطبيق جوال متعلق أو مرتبط به ومن خلال وصولك إلى واستخدامك لتطبيق الجوال أو موقع الويب. أنتم تُقِرّون بأنكم قد قرأت وفهمت ووافقت على الالتزام بهذه الشروط والأحكام، بصيغتها المعدلة من وقت لآخر. إذا كنت لا توافق على هذه الشروط والأحكام، فعليك التوقف عن استخدام أو الوصول إلى تطبيق الجوال و/أو موقع الويب على الفور. إذا كنت تستخدم تطبيق الجوال أو موقع الويب نيابة عن الغير بما في ذلك، على سبيل المثال لا الحصر، أي كيان تجاري، فأنت تتعهد بأنك مفوض ولديك سلطة إلزام الغير بهذه الشروط والأحكام.

٢.١ لا يعد التاجر الذي تشتري منه السلع أو الخدمات باستخدام خدمات تمارا طرفًا في هذه الشروط والأحكام وأي شروط سارية بينكم وبين التاجر مستقلة عن هذه الشروط والأحكام.

٣.١ نحتفظ بحقنا، وَفقا لتقديرنا المطلق، في إجراء تغييرات أو تعديلات على هذه الشروط والأحكام في أي وقت ولأي سبب. سنزودكم بإخطار مدته ثلاثون (30) يوم عمل بأي تغيير يطرأ على هذه الشروط والأحكام عبر وسائل الاتصال المتفق عليها كما هو موضح أدناه. و ستتاح لك الفرصة للاعتراض على أي تغيير مماثل في غضون عشرة (10) أيام عمل بعد تلقي إخطار من تمارا.

٤.١ يُعَدّ هذا التمهيد جزء لا يتجزأ من هذه الشروط والأحكام.

٢. تعريفات
تحمل الإشارات والكلمات والعبارات والمصطلحات التالية المدلولات الموضحة أمام كل منها في هذه الشروط والأحكام:

الأنظمة المطبقة: تعني أية أنظمة ولوائح منطبقة تخضع لها تمارا و/أو العميل.

العميل: يعني عميل التاجر الذي أنشأ حساب تمارا.

النزاع: يعني أي طلب استرداد أو خصم أو تعويض أو دعوى متقابلة أو نزاع من أي نوع يقدمه العميل ضد التاجر فيما يتعلق بالسلع أو الخدمات التي نتج عنها معاملة معتمدة

القوة القاهرة: تعني أي ظرف خارج عن السيطرة بما في ذلك، على سبيل المثال لا الحصر: (1) القضاء والقدر أو الفيضانات أو الجفاف أو الزلازل أو الكوارث الطبيعية الأخرى؛ (2) الوباء أو الجائحة؛ (3) الهجوم الإرهابي أو الحرب الأهلية أو الاضطرابات المدنية أو أعمال الشغب أو الحرب أو التهديد بالحرب أو التحضير لها أو النزاع المسلح أو فرض العقوبات أو الحظر أو قطع العلاقات الدبلوماسية؛ (4) التلوث النووي أو الكيميائي أو البيولوجي أو اختراق حاجز الصوت؛ (5) أي نظام أو أي إجراء تتخذه حكومة أو جهة عامة، بما في ذلك على سبيل المثال لا الحصر فرض قيود على التصدير أو الاستيراد أو الحصة أو الحظر، أو عدم منح الترخيص أو الموافقة اللازمة؛ (6) انهيار المباني أو نشوب حريق أو وقوع انفجار أو حادث؛ و(7) انقطاع أو فشل خدمة المرافق.

بيانات التعريف: تعني البيانات المطلوبة التي يجب أن يقدمها العميل إلى تمارا לإنشاء حساب له مع تمارا، كما جمعتها تمارا أو التاجر أو منصة التاجر لأغراض تقديم خدمات تمارا للعملاء.

حقوق الملكية الفكرية: تعني أي براءات اختراع ونماذج منفعة وحقوق في الاختراعات وحقوق التأليف والنشر والحقوق المجاورة والعلامات التجارية وعلامات الخدمة والأسماء التجارية وأسماء النطاقات وحقوق الاستحواذ والسمعة الحسنة والحق في رفع دعوى نتيجة البيع بالخِداع والتَّضليل أو المنافسة غير العادلة وحقوق في التصاميم، وحقوق في برامج الحاسوب، وحقوق قاعدة البيانات، وحقوق الحفاظ على سرية المعلومات (بما في ذلك المعرفة والأسرار التجارية) وأي حقوق ملكية فكرية أخرى، بما في ذلك جميع طلبات هذه الحقوق (وحقوق التقدم للحصول علي هذه الحقوق واستمناحها)، والتجديدات أو التمديدات المتعلقة بهذه الحقوق، وحقوق المطالبة بالتمتع بالأولوية في هذه الحقوق وجميع الحقوق المماثلة أو المكافئة أو أشكال الحماية القائمة أو التي ستبقى، الآن أو في المستقبل، في أي جزء من العالم.

منصة التاجر: تعني الوسائل، بما في ذلك على سبيل المثال لا الحصر مواقع الويب والتطبيقات، والتي تتيح لعدة تجار تقديم السلع والخدمات للعملاء من خلال منصة واحدة.

التاجر: عني أي كيان تجاري يقدم خدمات تمارا لعملائه وَفقا لاتفاقية بينه وبين تمارا، أو بين تمارا ومنصة التاجر، حسب ما يُستَجَدّ من وقت لآخر.

تطبيق الجوال: يعني تطبيق تمارا للجوّال المتاح للتنزيل من المتاجر الرقمية ذات العلاقة.

صافي المبلغ: يعني المبلغ الإجمالي الذي يتعين على العميل دفعه، بما في ذلك، أي ضريبة قيمة مضافة ورسوم شحن فيما يتعلق بطلب الشراء الذي يؤدي إلى معاملة واحدة معتمدة مطروحًا منها: (1) أي مبالغ مستردة؛ و(2) أي خصومات أو ائتمانات أو تخفيضات يطالب بها العميل ويوافق عليها التاجر ذي الصلة.

طلب الشراء: يعني الطلب المقدم من العميل من خلال النظام الأساسي أو موقع الويب أو تطبيق الجوال أو موقع التاجر على الويب أو أي تطبيقات أو نقاط بيع أخرى لاستخدام خدمات تمارا لشراء سلع أو خدمات من التاجر أو منصة التاجر ذات الصلة.

المبالغ المستردة: تعني المبلغ المتنازع عليه الذي دفعه العميل إلى تاجر يستخدم خدمات تمارا فيما يتعلق بمعاملة معتمدة تُستَردّ قيمتها لاحقًا إلى العميل بعد تسوية هذا النزاع.

حساب تمارا: عني الحساب الذي أنشأه العميل لاستخدام خدمات تمارا، والذي سيخضع استخدامه وتشغيله لهذه الشروط والأحكام.

خدمات تمارا: تعني خدمات الدفع التي تقدمها تمارا، وَفق ما يُستَجَدّ من وقت لآخر، والتي يختارها العميل على موقع التاجر أو منصة التاجر أو في أي نقطة بيع أخرى مع التاجر أو على منصة التاجر التي يختار العميل بمُوجِبها الشراء. تخضع البضائع أو الخدمات من التاجر أو منصة التاجر باستخدام خدمات تمارا لهذه الشروط والأحكام.

المعاملة: تعني الطلب المقدم عبر حساب تمارا الخاص بكم، بناءً على طلب شراء، للاستفادة من خدمات تمارا من أجل إكمال وتسوية طلب الشراء هذا مع التاجر ذي الصلة.

بيانات المعاملة: تعني جميع البيانات المتعلقة بطلب الشراء والمعاملة

نحن: الإشارات إلى ضمير المتكلم المنفصل "نحن" أو ضمير المتكلم المتصل "نا" أو أية ضمائر أخرى مماثلة في هذه الشروط والأحكام هي إشارات إلى تمارا والكيانات والأشخاص التابعين لها

الموقع الإلكتروني: يعني موقع تمارا على العنوان التالي: https://tamara.co

أنتم: الإشارات إلى ضمير المُخاطَب المنفصل "أنتم" أو المُخاطَب المتصل "ــكُم" أو أية ضمائر أخرى مماثلة في هذه الشروط والأحكام هي إشارات إلى العميل ذي الصلة المشار إليه في بيانات التعريف التي يجب تقديمها قبل استخدام خدمات تمارا

٣. الأهلية والصلاحية:
١.٣ باستخدام خدمات تمارا، فإنك تتعهد وتُقِرّ بأنك تتمتع بالأهلية النظامية للدخول في هذه الشروط والأحكام وأن عمركم يتجاوز حَدّ الثمانية عشر (18) عامًا.

٢.٣ ذا سجّلت بصفتك كيانًا تجاريًا أو شخصًا اعتباريًا أو أي كيان آخر، فإنك تتعهد وتُقِرّ بأن لديك السلطة والقدرة اللازمتين للدخول إلى كيانك وإلزامه بهذه الشروط والأحكام، وأنك والشركة ستمتثلون لجميع الأنظمة والمتطلبات المنطبقة.

٣.٣ بالنقر فوق الموافقة على هذه الشروط والأحكام، فإنك تُقِرّ بأنك قبلت هذه الشروط والأحكام إلكترونيًا.

٤. الحسابات والتسجيل:
١.٤ تتطلب عملية تسجيل حساب تمارا منكم تزويد تمارا بمعلومات شخصية معينة لأغراض (1) إنشاء حساب تمارا؛ (2) تقديم أية خدمات تمارا؛ و(3) الامتثال لأية أنظمة أو لوائح منطبقة، بما في ذلك، على سبيل المثال لا الحصر، الامتثال لالتزامات "اعرف عميلك". قد تتضمن هذه المعلومات اسمك الكامل وعنوانك وبريدك الإلكتروني ورقم الهاتف وعمرك. أنت تُقِرّ وتوافق على أن أية معلومات شخصية مقدمة من قبلكم هي صحيحة ودقيقة وكاملة ومحدثة، وفي حال حدوث أي تغيير على هذه البيانات أو أي معلومات وظروف أخرى قد تؤثر على أهليتك للاستمرار في استخدام خدمات تمارا فإنه يجب عليك إخطار تمارا على الفور وفقا لهذه الشروط والأحكام.
٢.٤ أنت توافق بمُوجِب هذه الشروط والأحكام على الإفصاح عن جميع التزاماتكم المالية، بِناءً على طلب تمارا أو أيٍّ من وكلائها أو متعاقديها من الباطن، والامتناع عن حجب أية معلومات قد تكون مؤثرة أو مهمة لأيٍّ من أطراف اتفاقية التمويل.
٣.٤ أنت توافق بمُوجِبه على أنكم ستكون مسؤول عن أي نشاط تحت حساب تمارا الخاص بكم وتوافق على الحفاظ على التدابير الأمنية المناسبة لتفاصيل حسابك على أساس مستمر.

٤.٤ إذا فقدت كلمة المرور الخاصة بك أو سُرِقَت منك، أو إذا كنت تعتقد أن ثمّة وصول غير مصرح به إلى حساب تمارا الخاص بك، فيجب عليك تغيير كلمة المرور لحساب تمارا الخاص بكم و إخطارنا على الفور. أنت مسؤول عن أية معاملات تُجرى باستخدام بيانات اعتماد حساب تمارا المسروقة ما لم تخطرنا على الفور بإيقاف نشاطه مؤقتًا، وتتلقى رسالة من تمارا تفيد بأن حساب تمارا الخاص بكم قد تقرر إيقاف نشاطه مؤقتًا أو إلغائه.

٥.٤ لا يحق لك مشاركة بيانات اعتماد حساب تمارا الخاص بكم مع أي شخص آخر. وأنت تُقِرّ وتوافق على رد قيمة أي معاملة أُجريَت باستخدام حساب تمارا الخاص بك إلى تمارا والتي طلبتموها أنتم أو أي شخص آخر وصل إلى خدمات تمارا من خلال استخدام اسم المستخدم أو كلمة المرور الخاصة بك، سواء سمحتم بذلك أم لم تسمحوا بهذا الوصول.

٦.٤ يجب عليك إخطار تمارا على الفور بأي نشاط احتيالي أو غير نظامي مشتبه به أو فعلي تَحَدَّدَ نتيجة لاستخدامك لخدمات تمارا. قد يؤدي عدم تنفيذ ذلك إلى تعليق أو إنهاء حساب تمارا الخاص بك، بالإضافة إلى أي إجراء نظامي إضافي آخر تتخذه تمارا وَفقا لتقديرها الكامل. وعندما ينشأ النشاط الاحتيالي أو غير النظامي المشتبه به أو الفعلي من تاجر أو منصة تجارية باستخدام خدمات تمارا، يجب عليكم إبلاغ تمارا على الفور عن هذا التاجر قبل اتخاذ أي إجراء آخر.

٧.٤ وَفقا لتقدير تمارا الكامل، إذا كانت لديها أي شكوك في أن أيًا من المعلومات التي قدمتها غير صحيحة أو غير دقيقة أو غير كاملة أو غير مُحَدَّثَة، دون الإخلال بأي حقوق أو تعويضات أخرى، وَفقا لهذه الشروط والأحكام أو وَفقا للأنظمة المنطبقة، يحق لتمارا إيقاف أو تقييد الوصول إلى الخدمات و/أو تطبيق الجوال و/أو الموقع الإلكترون.

٨.٤ قد تُجرِي تمارا، وَفقا لتقديرها الكامل، أي استفسارات تراها ضرورية (سواء بشكل مباشر أو من خلال الغير)، وتطلب منكم تقديم مزيد من المعلومات أو المستندات حسب الضرورة. إذا كنت صاحب عمل أو مسجل نيابةً عن صاحب عمل، فقد تتضمن هذه المعلومات أو المستندات ترخيصًا تجاريًا و/أو مستندات رسمية للشركة و/أو مستندات أخرى توضح سلطة أي شخص للتصرف نيابة عنكم. وأنت تُقِرّ وتوافق على تقديم أيّة معلومات و/أو مستندات إلى تمارا عند الطلب. أنتم تُقِرّون وتوافق أيضًا على أنه إن لم تقدروا على فعل ذلك، يجوز لتمارا، دون أية مسؤولية، تقييد أو تعليق أو سحب وصولكم إلى الخدمات أو تطبيق الجوال أو الموقع الإلكتروني. وتحتفظ تمارا بحقها في إلغاء أي حسابات لم يجرِ التأكد أو التحقق من صحتها أو حسابات لم تكن نشطة، حسب تقدير تمارا الكامل.

٩.٤ عند الانتهاء من عملية التسجيل، فإنك تُقِرّ و توافق على أنكم قد قرأتم هذه الشروط والأحكام وفهمتموها وتوافق على الالتزام بها. وتُعَدّ هذه الشروط والأحكام متضمنة سياسة خصوصية تمارا، المتوفرة https://tamara.co/privacy-policy.html ووَفق ما يُستَجَدّ من وقت لآخر.

١٠.٤ في حالة رفض طلبك فيما يتعلق بالحصول على حساب تمارا أو أي من خدمات تمارا، سنبلغكم بسبب هذا الرفض في غضون خمسة (5) أيام عمل.

٥. خدمات تمارا:
١.٥ تمارا هي مزود مدفوعات عبر الإنترنت يقدم للعملاء مجموعة متنوعة من طرق الدفع عند شراء سلع أو خدمات من خلال العديد من التجار أو منصات التجار..

٢.٥ يعرض موقع تمارا الإلكتروني وتطبيق الجوال قائمة بالتجار المستقلين الذين يقبلون تمارا كخيار دفع، وَفق ما يُستَجَدّ من وقت لآخر. أَبرَم هؤلاء التجار اتفاقيات مُلزِمَة مع تمارا لتقديم هذه المُنتَجات أو الخدمات من خلال مواقع الويب أو التطبيقات أو منصات التجار.

٦. التواصل الإلكتروني:
١.٦ من خلال إنشاء حساب تمارا، فإنك تُقِرّ وتوافق على أنك ستتواصل معنا إلكترونيًا. لذا، فإنك توافق على أنه يجوز لتمارا تقديم جميع المراسلات وبيانات الدفع والشروط والأحكام والمعلومات المطلوب منا تقديمها بمُوجِب النظام وجميع المراسلات المتعلقة بأية شكاوى ومعلومات أخرى إليكم إلكترونيًا إلى عنوان البريد الإلكتروني الذي قدمتموه إلينا.

٢.٦ لضمان قدرتنا على التواصل معكم إلكترونيًا، فإنكم توافقون على أنه من مسؤوليتكم إخطارنا على الفور بأي تغيير في عنوان بريدكم الإلكتروني ورقم جوّالكم أو أيّة معلومات أخرى تقدمونها لنا. قد نتصل بكم من حين لآخر لطلب تحديث لهذه المعلومات وأيّة معلومات أخرى متعلقة بحساب تمارا الخاص بكم.

٧. حقوق الملكية الفكرية:
١.٧ أنت تُقِرّ بأن جميع حقوق الملكية الفكرية على الموقع الإلكتروني و/أو تطبيق الجوال (حسب الاقتضاء)، هي ملكية لتمارا وشركاتها التابعة ، إلى الحد الأقصى الذي يسمح به النظام.

٢.٧ يُعَدّ شعار تمارا والرموز المرتبطة به علامات تجارية مملوكة لشركة تمارا. ولا يجوز استخدام علامات تمارا التجارية فيما يتعلق بأي مُنتَج أو خدمة لا تقدمها تمارا، بما في ذلك أي مُنتَج أو خدمة تنتقص من قَدر تمارا أو تضر بسمعتها.

٣.٧ يحظر عليك استخدام أي علامة تجارية أو أي حقوق ملكية فكرية تخص تمارا، من أي جزء من خدمات تمارا، ويحظر عليكم استنساخ أو تعديل خدمات تمارا أو إجراء أية عملية إعداد أو نشر أو تنفيذ أو إرسال أو عرض، أو بَثّ أو أي وسيلة أخرى لاستغلال خدمات تمارا ما لم تسمح تمارا بذلك أو تأذن به صراحةً كتابةً. كما لا يجوز لكم، وأنتم توافقون على عدم قيام الآخرين أو تمكينهم من نَسخ أو فَك تجميع أو إجراء هندسة عكسية أو تفكيك أو محاولة اشتقاق كود مصدر أو فك تشفير أو تعديل أو إنشاء أعمال مشتقة من خدمات تمارا أو أي جزء منها (باستثناء ما هو محظور فقط إلى الحد الذي تحظر الأنظمة المنطبقة).

٨. استخدام موقع الويب وتطبيق الجوال:
١.٨ يحظر استخدام موقع تمارا الإلكتروني و/أو تطبيق تمارا لنشر أي من المحتوى التالي: أي استخدام للغة بذيئة أو فاحشة أو إهانات أو إساءة ثقافية أو دينية أو أي محتوى سياسي أو نقدي أو مادة قد تهدد المصلحة العامة أو الأمن القومي أو تتسبب في التشهير أو التطاول أو القذف أو أي محتوى آخر قد يكون مسيئًا أو فاحشًا أو غير لائق.

٩. قوائم المُنتَجات والتوافر:
١.٩ أنت تدرك أن تمارا مجرد مزود مدفوعات ولا تتحمل أية مسؤولية عن تصنيع أو شحن أو إنتاج أو تسليم أي من المُنتَجات أو الخدمات المشتراة عبر تمارا. وعليه، لن تكون تمارا مسؤولة عن التوافر أو التأهل أو أي خاصية أخرى لأي مُنتَجات معروضة على موقع التاجر أو التطبيق أو منصة التاجر.

١٠. خدمة ما بعد بيع المُنتَجات:
١.١٠ تمارا غير مسؤولة عن أي مُنتَجات أو خدمات تُباع من خلال أي مواقع إلكترونية أو تطبيقات أو منصات تجارية خاصة بالتاجر. سيوفر هذه المُنتَجات والخدمات ويدعمها التجار أو مصنعوهم أو وكلاؤهم المحليون فقط، فضلًا عن مورّدِيهم، وَفقا للشروط والأحكام المرتبطة بكل مُنتَج أو خدمة. تستبعد تمارا صراحةً أي ضمان من أي نوع للمُنتَجات أو الخدمات المباعة على مواقع الويب والتطبيقات ومنصات التجار. يجب توجيه أي طلبات للدعم الفني أو خدمة العملاء أو خدمة ما بعد البيع فيما يتعلق بالمُنتَجات أو الخدمات إلى التاجر ذي الصلة.

١١. المدفوعات:
١.١١ بمجرد إنشاء حساب تمارا وَفقا لهذه الشروط والأحكام، ستتمكن من الوصول إلى خدمات تمارا عندما تختار الدفع مقابل السلع أو الخدمات باستخدام خيار الدفع لخدمات تمارا مع التاجر أو منصة التاجر ذات الصلة.

٢.١١ تتيح خدمات تمارا شراء سلع أو خدمات من تاجر أو منصة تجارية. وعندما تختارون أحد خيارات الدفع في تمارا، قد تنطبق شروط وأحكام مختلفة بالإضافة إلى هذه الشروط والأحكام، وقد تُحَصِّل تمارا رسومًا، والتي يتعين عليك دفعها لاحقًا.

٣.١١ أنت مسؤول عن فهم وقبول جميع الرسوم المرتبطة بطلب الشراء الخاص بكم كما هو مقرر أثناء عملية الدفع. حيثما ينطبق أي مبلغ متأخر، فإنكم تتعهد بدفعه إلى تمارا.

٤.١١ بمجرد اختياركم لخدمات تمارا في نقطة بيع التاجر أثناء عملية الدفع، سيُطلب منكم اختيار طريقة دفع تصبح فعالة وملزمة بينكم وبين تمارا فيما يتعلق بطلب الشراء.

٥.١١ قد تكون رسوم الخدمة منطبقة على طرق دفع معينة و/أو تجار معيّنين. سيُعرَض مبلغ هذه الرسوم بوضوح أثناء المغادرة. أنتم مسؤولون عن مراجعة المبلغ الإجمالي الخاص بكم قبل إنهاء المعاملة للتأكد من أنّكم على علم بجميع الرسوم المطبقة.

٦.١١ في حالة عدم توفر هذه المعلومات بالفعل عبر موقع تمارا الإلكتروني و/أو تطبيق تمارا، يحق لكم طلب نسخة من الاتفاقية الكاملة التي أبرمتها معنا في غضون عشرة (10) أيام عمل بعد إبرام الاتفاقية، وكذلك أي بيانات معاملات ذات صلة (بما في ذلك جميع الرسوم والتكلفة المتكبدة خلال فترة زمنية محددة وجميع التكاليف والرسوم الإضافية، في حالة التخلف عن السداد أو السداد المبكر للتمويل) على أساس ربع سنوي.

٧.١١ تُقِرّ بأنّك تتحمل المسؤولية الكاملة عن أي طلب شراء أو معاملة أو أي رسوم مرتبطة بخدمات تمارا، بغض النظر عما إذا كانت السلع أو الخدمات ذات الصلة قد تسلمتموها أو قُدِّمَت إليكم بنجاح (حسب الاقتضاء).

٨.١١ تحتفظ تمارا بحقّها في إجراء أي تغيير أو تعديل على أي طريقة دفع أو على توفير خدمات تمارا.

٩.١١ توفر تمارا خدمات الدفع الإلكتروني من خلال مزودي خدمة خارجيين. ولا تتحمل تمارا أية مسؤولية عن أي خطأ أو ضرر أو أي خسارة قد تتعرض لها نتيجة استخدام طريقة الدفع الإلكترونية؛ إذ يقع ذلك ضمن نطاق مسؤولية مزود الخدمة الخارج.

١٠.١١ يجب عليك التأكد من أن لديك أموالاً كافية في حساب تمارا الخاص بكم، قبل تقديم طلب الشراء أو محاولة إتمام المعاملة. أنت وحدك مسؤول عن الامتثال لأي من حدود معاملات منطبقة.

١١.١١ بمُوجِب هذه الشروط والأحكام، فإنّك توافق وتفوض تمارا بسحب المبلغ ذي الصلة اللازم لإتمام معاملة من بطاقة الدفع المخزنة في حساب تمارا الخاص بكم في تاريخ استحقاق الدفع. وفي حالة رفض معاملة بسبب نقص الأموال التي تغطي قسط التأمين، فستُجرَى محاولة لخصم هذه الأموال تلقائيًا كل يومين (2) إلى حين دفع المبلغ بالكامل. تحتفظ تمارا بحقها في إحالة قضيتكم إلى أية وكالة تحصيل ائتمان سارية و/أو مشاركة بياناتكم مع أية جهات تنظيمية سارية وَفقا لتقديرها الكامل.

٢١.١١ بموجب هذه الاتفاقية ، أنت توافق على اعطائنا الأذن بالتحقق من سجلك الائتماني والحصول على تقريرك الائتماني و التحقق من هويتك عن الطريق النفاذ الوطني الموحد (نفاذ) أو أي مصادر بيانات أخرى ذات صلة، كما أنك تقر بمعرفة أن تقريرك الائتماني قد يؤثر على قبول طلبك للدفع مع تمارا وذلك بحسب سلوكك الائتماني وسجل مدفوعاتك، كما قد تضطر تمارا إلى مشاركة معلومات عن تاريخ سلوكك الائتماني أو أي معلومة أخرى إلى الشركة السعودية للمعلومات الائتمانية (سمة) أو أي جهة أخرى معتمدة من قبل البنك المركزي السعودي(ساما).

٣١.١١ أنت تتعهد وتقرّ بمُوجِبه أن لديكم أموالاً كافية متاحة للوفاء بأي التزامات مالية تجاه تمارا حسب الاقتضاء من وقت لآخر. ولتمارا الحق في التعاون مع التاجر في حالة عدم وفائك بالتزاماتك بالدفع. ويشمل ذلك التعاون، على سبيل المثال لا الحصر، تعليق الاشتراك/الخدمات ذات الصلة أو الاستيلاء على المُنتَج/البضائع إلى حين الوفاء بالدفعات.

٤١.١١ أنت توافق بموجب هذه الاتفاقية على تفهمك وتحملك للعواقب المحتملة عند استخدام الخدمة التمويلية خلافاً للشروط المتفق عليها. وتوافق على أحقية تمارا (وحسب مطلق اختيارها) بإخطار الشركة السعودية للمعلومات الائتمانية ("سمة") في حالة تأخرك أو عجزك عن السداد.

٥١.١١ أنت توافق بمُوجِبه على أنّك المستفيد الحقيقي من خدمات تمارا للدفع وأنّك لا تستخدم خدمات تمارا في أي عمليات غسيل أموال أو أنشطة غير نظامية أخرى.

١٢. استرداد المدفوعات:
١.١٢ تمارا غير مسؤولة عن أي قرار يتخذه التاجر أو منصة التاجر بشأن المبالغ المستردة، حسب الاقتضاء بينكم وبين التاجر أو منصة التاجر. قد تختار تمارا، مع ذلك، أن تلعب دورًا في تسهيل عمليات الاسترداد هذه وَفقا لتقديرها الخاص، شريطة ألا ينطوي هذا الدور على أية مسؤولية فيما يتعلق بأي استرداد. ومع ذلك، ستظل تمارا مسؤولة عن معالجة دفع أي مبلغ مسترد كما هو مقرر بينكم وبين التاجر أو منصة التاجر.

١٣. السرّية والخصوصية:
١.١٣ تمارا ملتزمة بالحفاظ على سرّية المعلومات والبيانات الائتمانية التي بحوزتها.

٢.١٣ أنت توافق بمُوجِبه على تقديم أيّة معلومات، بما في ذلك بيانات التعريف أو الوثائق التي تطلبها تمارا بشكل معقول للتحقق من هويتكم فيما يتعلق بحساب تمارا الخاص بكم أو أي استخدام لخدمات تمارا للدفع، وتفوضنا بإجراء أي استفسارات نعتقد أنها ضرورية من أجل التحقق من هويتكم. وتحتفظ تمارا بحقّها في إغلاق حساب تمارا الخاص بكم أو تعليق أو تقييد وصولكم إلى خدمات تمارا للدفع إذا لم نتمكن من الحصول على أيٍّ من هذه المعلومات أو التحقق منها بما يرضينا.

٣.١٣ أنت توافق بموجب هذه الاتفاقية وتفوض تمارا في استخدام أي من أو جميع معلومات التعريف و البيانات الشخصية الخاصة بك التي تم جمعها من خلال المواقع الإلكترونية أو المنصات أو تطبيقات الهواتف المحمولة الخاصة بتمارا أو التجار من وقتٍ لآخر ويجوز استخدامها أو الإفصاح عنها إلى أشخاص آخرين . وقد يشمل ذلك مشاركة معلومات التعريف الخاصة بك وأية معلومات أخرى مع أطراف خارجية لأغراض التحقق من الائتمان ومكافحة غسل الأموال أو غيرها من الفحوصات المماثلة أو لأي غرض آخر تعتبره تمارا ضروريًا من أجل تمكين تمارا من تقديم خدمات الدفع لك والالتزام بجميع القوانين واللوائح المعمول بها.

٤.١٣ أنت توافق على هذه الشروط والأحكام وعند دخولك أو استخدامك لموقع تمارا الإلكتروني أو تطبيق تمارا، فإنّكم توافقون بمُوجِبه على سياسة الخصوصية، علمًا بأننا نجمع بياناتكم الشخصية ونفهم آلية التعامل معها.

٥.١٣ إذا كنت لا توافق على سياساتنا وممارساتنا، فلن تتمكن من استخدام موقع تمارا الإلكتروني أو تطبيق تمارا ونرجو عدم الاستمرار في استخدام خدماتنا.

٦.١٣ يحق لك سحب موافقتكم على معالجة بياناتكم الشخصية في أي وقت، وَفقا للقيود التعاقدية والنظامية والاشعار الكتابي.

٧.١٣ لا يجوز الإفصاح للغير عن أيّة معلومات تتلقونها بمُوجِب هذه الشروط والأحكام أو أي عقد آخر مبرم مع تمارا. يجب الوصول بِسرّية إلى أيّة معلومات تتعلق بأعمال تمارا، ضمن الحدود التي قد تؤثر سلبًا على أعمال تمارا، وستكونون مسؤولين عن تعويض تمارا عن أية خسارة في العمل أو السمعة، إذا حدث ذلك نتيجة لأي فعل ناتج عن وصولكم إلى هذه المعلومات.

١٤. حدود المسئولية:
١.١٤ تمارا مزود خدمة مستقل وليست طرفًا في أي ترتيبات مباشرة بين العملاء والتجار أو أي أطراف ثالثة أخرى ذات صلة. لن تكون تمارا مسؤولة بأي حال من الأحوال عن أي مطالبة أو نزاع يُنسَب إلى التجار ولن تكون مسؤولة عن أي إخفاق أو أضرار ناجمة عن علامة مُنتَجات أو خدمات التجار أو الموثوقية أو الكفاية أو الأصالة أو التوفر أو الشرعية.

٢.١٤ التجار الخارجيون هم مقدمو خدمة مستقلون لا يخضعون لهذه الشروط والأحكام ويتعاقدون فقط مع تمارا. لا يُعَدّ التجار موظفين أو ممثلين أو وكلاء لشركة تمارا. ويتحمل التجار المسؤولية الكاملة عن جميع المعاملات التي تتم بينهم وبين العملاء أو المعاملات الأخرى ذات الصلة، وفي حالة وجود نزاع بينكم وبين أي تاجر أو طرف ثالث، فإنّكم تتعهدون بإبراء ذمة تمارا من أية مسؤولية تنشأ عن أو تتعلق بهذه النزاعات. وبهذا التعهد تعفون تمارا (ووكلائها وموظفيها) من المطالبات والمطالب والالتزامات والتعويضات من أي نوع أو طبيعة، معروفة أو غير معروفة، مُفصَح عنها أو غير مُفصَح عنها، ناشئة عن هذه النزاعات أو متعلقة بها بأي شكل من الأشكال.

٣.١٤ من خلال الموافقة على هذه الشروط والأحكام، فإنّك تقرّ بإمكانية حدوث مخاطر أو أخطاء من التجار أو أي من مزودي الخدمات الخارجيين. لذا، يكون استخدام خدمات تمارا واقعًا ضمن نطاق مسؤوليتكم الحصرية ولا تتحمل تمارا أية مسؤولية تجاهها.

٤.١٤ لن تكون تمارا مسؤولة تجاهك أو تجاه أي شخص آخر عن أية أضرار مباشرة أو غير مباشرة أو عرضية أو خاصة أو جزائية أو عقابية أو تبعية قد تنشأ، حتى لو جرى إبلاغ تمارا بإمكانية حدوث هكذا أضرار، ولن تكون تمارا كذلك مسؤولة عن أية أضرار أو التزامات أو خسائر تتكبدها، والتي تنشأ عن استخدامك للخدمات أو اعتمادكم عليها، أو نتيجة لعدم قدرتكم على الوصول إلى الخدمات أو استخدامها، أو عن أي معاملة أو علاقة نشأت بينكم وبين التاجر، حتى عندما كانت تمارا على علم بإمكانية حدوث هكذا أضرار. ولن تكون تمارا مسؤولة عن أي تأخير أو فشل في التنفيذ، ولن تتحمل المسؤولية في حالة عدم حصول التاجر على التراخيص والتصاريح المناسبة.

٥.١٤ تُقَدَّم الخدمات على أساس "حالتها التي هي عليها"، وتُخلِي تمارا مسؤوليتها عن جميع الإقرارات والضمانات، الصريحة أو الضمنية، أو النظامية التي لم تُذكَر صراحةً في هذه الشروط والأحكام، بما في ذلك الضمانات الضمنية فيما يتعلق بقدرة البائع ومدى ملاءمته لخدماته لغرض معين. ولا تُقَدِّم تمارا أي إقرار أو ضمان حول الموثوقية أو الجودة أو الاستدامة أو التوفر أو المالك الأصلي للخدمات أو السلع أو أية خدمات تُطلَب من خلال استخدام خدمات تمارا، ولا تضمن تمارا عدم انقطاع الخدمات أو خلوها من الأخطاء. وإلى أقصى حد تسمح به الأنظمة المنطبقة، تقرّون وتوافقون بمُوجِبه على أنّكم تتحملون جميع المسؤوليات الناشئة عن استخدامكم لأيٍّ من الخدمات التي تقدمها تمارا.

٦.١٤ نوفِّر المعلومات الموجودة على الموقع الإلكتروني وتطبيق الجوال للأغراض العامة فقط. وتبذل تمارا جهودًا معقولة لإبقاء المعلومات مُحَدَّثَة وصحيحة، ولكنها لا تقدم أية تعهدات أو ضمانات من أي نوع، سواء أكانت صريحة أم ضمنية، من حيث اكتمال أو دقة أو موثوقية أو ملاءمة أو توفر الموقع أو تطبيقات الجوال أو المعلومات أو الخدمات أو الإعلانات أو الرسومات ذات الصلة الموجودة على الموقع الإلكتروني أو تطبيق الجوال لأي غرض، وبالتالي يجب عليكم الاعتماد على هذه المعلومات على مسؤوليتكم الخاصة.

٧.١٤ أسباب تتعلق بالأمان والأداء، تُراقَب جميع حسابات تمارا بانتظام.

٨.١٤ تمارا غير مسؤولة عن أي تأخير أو انقطاع أو فشل في تقديم الخدمات بسبب حدث قوة قاهرة.

٩.١٤ أنتم تقرّون وتوافقون بمُوجِبه على تعويض واحتجاز تمارا وأي من الشركات التابعة لها ومسؤوليها ومديريها وموظفيها ووكلائها من وضد أي وجميع المطالبات أو الالتزامات أو الأضرار أو الخسائر أو المصروفات أو النفقات، بما في ذلك على سبيل المثال لا الحصر، الرسوم النظامية والمحاسبية الناشئة عن أو المتعلقة بأي شكل من الأشكال بما يلي:
[ "(أ) وصولكم إلى أو استخدامكم أو عدم قدرتكم على استخدام حساب تمارا أو خدمات تمارا.", "(ب) إهمالكم أو سوء سلوككم.", "(ج) انتهاككم لأية أنظمة منطبقة؛ و/أو.", "(د)فشلكم في تقديم معلومات صحيحة ودقيقة وحديثة وكاملة والحفاظ عليها فيما يتعلق بحساب تمارا الخاص بكم." ]

١٠.١٤ إذا كنتم لا توافق على أي بند من هذه الشروط والأحكام، فلا يجوز لكم الوصول إلى الموقع الإلكتروني أو تطبيق الجوال، ولا استخدام خدمات تمارا.

١٥. تَعَهُّد:
١.١٥ يشكل هذا البند إشعارًا لك بأننا تعهدنا بجميع حقوقنا وحقوقنا وفوائدنا في هذه الشروط والأحكام ، ما في ذلك الحق في استقطاع أي مبلغ مستحق الدفع بواسطتك وفقًا لهذه الشروط والأحكام. وعليه ستظل شركة تمارا مؤهله لممارسة جميع حقوقها وصلاحيتها في التقدير وطرق الانتصاف ويجب عليك الالتزام بدفع أي مبلغ مستحق الدفع من قبلك ، ما لم تتلقى إشعارًا كتابيًا بخلاف ذلك. وفي هذه الحالة، يحق لك المطالبة بجميع الحقوق والسلطات والتقديرات وسبل الانتصاف، وذلك بموجب إشعار، كما أنك من خلال الموافقة على هذه الشروط والأحكام، فإنك تقر وتقبل شروط هذا البند.

١٦. التعويض:
١.١٦ أنت تقرّ وتوافق على تعويض ودرء الضرر عن تمارا وما يتبعها من كيانات وجهات راعية وشركاء ومديرية والتزام وموظفين وسداد جميع الخسائر التي تكبدتها وكذلك قيمة الأضرار والمسؤوليات والمطالبات والأحكام والتسويات والغرامات والتكاليف والنفق (بما في ذلك أيّة مصاريف وأتعاب نظامية وتكاليف التحقيق وأتعاب المحاماة). في حالة تعرُّض تمارا لأية أضرار تسببتم بها أو إذا نَشَأَت أو كانت مرتبطة بخرقكم لهذه الشروط والأحكام أو سياسة الخصوصية أو استخدامكم أو استخدام طرف ثالث (متعاقد معكم) للخدمات.

١٧. الإشعارات
١.١٧ يجب أن تكون جميع الإشعارات والمراسلات الأخرى بمُوجِب هذه الشروط والأحكام مكتوبة عن طريق المراسلة إلى بريد تمارا الإلكتروني المعروض على موقع تمارا الإلكترون.

١٨. أحكام عامة
١.١٨ تخضع حقوق والتزامات الأطراف الواردة في هذه الشروط والأحكام وتُفَسَّر وَفقا لأحكام أنظمة المملكة العربية السعودية.

٢.١٨بالموافقة على هذه الشروط والأحكام، فإنّك تتعهد بالخضوع دون قيد أو شرط للاختصاص القضائي الحصري لمحاكم المملكة العربية السعودية فيما يتعلق بأي إجراءات نظامية ناشئة عن أو متعلقة بهذه الشروط والأحكام، أو العلاقات النظامية التي نشأت عنها، أو الموضوعات المختلفة الواردة هنا. يتنازل الطرفان بمُوجِبه ويوافقان على عدم التأكيد (عن طريق رفع طلب أو مذكرة دفاع أو غير ذلك) على أن أي إجراء مماثل قد اتُّخِذَ في محكمة مختصة غير ملائمة أو لدى مَقَرّ غير مناسب.

٣.١٨أنتم توافقون بمُوجِبه على التعاون مع تمارا إلى أقصى حد تسمح به الأنظمة المنطبقة، بما في ذلك الموافقة على الإجابة كتابيًا على أي أسئلة أو تقديم معلومات لمساعدة تمارا في إجراء أي تحقيق داخلي أو استفسار.

٤.١٨بمُوجِب هذه الشروط والأحكام، تقرّون بأن تمارا قد تفصح عن معلومات عنكم وعن حسابكم المذكور أعلاه أو أي حساب آخر مع أي مُنَظِّمِين بمُوجِب الأنظمة المنطبقة، وأي قواعد سارية لاتحاد البطاقات المصرفية نافذة من وقت لآخر، و/أو الممثل المعتَمَد للمُنَظِّمِين ذوي الصّلة، بما في ذلك، على سبيل المثال لا الحصر، الشركة السعودية للمعلومات الائتمانية (سمة) من خلال اتفاقية العضوية المبرمة وقواعد العمل المعتمدة لتبادل المعلومات و/أو مع أي طرف آخر على نحو ما يعتمده البنك المركزي السعودي ("ساما") أو أية مؤسسة مالية محلية أخرى ذات صلة.

٥.١٨إذا تقرر انعدام صلاحية أو نفاذ أو سريان أيَّ شرط أو حكم من هذه الشروط والأحكام، فسيُعَدّ هذا الشرط أو الحكم فقط غير ساري دون التأثير بأي شكل من الأشكال على بقية هذه الشروط والأحكام.

٦.١٨تصبح هذه الشروط والأحكام سارية في التاريخ الذي تدخلون فيه إلى موقعنا الإلكتروني أو تطبيقنا و/أو في التاريخ الذي تشيرون فيه إلى موافقتكم عبر إنشاء حساب تمارا وستظل سارية إلى حين إلغاء أو إبطال تمارا لها وَفقا لتقديرها الكامل.

٧.١٨إذا اختارت تمارا، وَفقا لتقديرها الخاص، إلغاء تنشيط وصولك إلى حساب تمارا الخاص بكم، وبالتالي إنهاء هذه الشروط والأحكام، فسيتم اخطاركم من تمارا عن طريق إرسال إشعار إلى عنوان البريد الإلكتروني الذي قدمتموه إلى تمارا. وأنتم توافقون وتقرّون بمُوجِبه بأن لتمارا الحق المطلق في إنهاء هذه الشروط والأحكام بسبب أو بدون سبب وليس عليها أي التزام بإعلامكم بسبب إنهاء هذه الشروط والأحكام.

٨.١٨بإغلاق حساب تمارا الخاص بكم باتّباع الإرشادات الموجودة على موقع تمارا الإلكتروني أو تطبيق تمارا، ستوقف انطباق هذه الشروط والأحكام. وتجنّبًا للشك، ستظلون مسؤولين عن جميع الالتزامات المتعلقة بحساب تمارا الخاص بكم وجميع المبالغ المترصدة في ذمتكم لصالح تمارا (بما في ذلك الرسوم المتأخرة) حتى بعد إغلاق حساب تمارا الخاص بكم و/أو ايقاف تطبيق هذه الشروط والأحكام.

١٩. الشكاوَى:
١.١٩ نحن ملتزمون بتقديم مستوى خدمة ممتاز لعملائنا. ونحن نُقَدِّر ملاحظات العملاء كثيرًا لأنها تساعدنا على تحسين خدماتنا باستمرار. فإذا كنتم لا تشعرون أنّكم تتلقون خدمة عملاء ممتازة، أو أنه يمكن تحسين شيءٍ ما، فنرجو إخبارِنا بذلك.

٢.١٩ اذا أخفقنا في تلبية المعايير العالية التي وضعناها لأنفسنا، فإننا نرغب في إتاحة الفرصة لوضع الأمور في نصابها الصحيح. ومع ذلك، فإننا ندرك أن الأمور قد تسوء من حين لآخر، وإن حدث ذلك، فنحن ملتزمون بحلّ الأمور حَلًّا فوريًّا وعادلًا. في حال رغبتك برف شكوى يرجي التواصل معنا من خلال الرقم الآتي:8001240441ا.

٣.١٩ عند تلقي أي شكوى سيتم اتخاذ الاجراءات الاتية : (1) إرسال إقرار كتابي عن الشكوى في غضون خمسة (5) أيام عمل من استلامها وابلاغكم بأي تفاصيل ناقصة قد نطلبها لإتمام معالجة الشكوى؛ (2) التحقيق في المخاوف وترتيب مناقشة معكم لمحاولة الاتفاق على كيفية حل المشكلات؛ (3) الرد بقرارنا النهائي بشأن هذه المسألة، وتحديد نتيجة تحقيقنا وأي مقترحات لتصحيح الأمر أو حله، في غضون عشرة (10) أيام عمل من تلقي شكواكم الكاملة؛ و(4) تذكيركم بأنه قد يحق لكم إحالة شكواكم إلى البنك المركزي السعودي ("ساما") وتقديم تفاصيل لفعل ذلك، في نهاية عملية تقديم الشكاوى لديناا.

٢٠. الأخطاء:
١.٢٠ في حال علمنا بوجود أي خطأ أو عطل في حساب تمارا الخاص بكم، سنتّخذ ما يلي: (1) الإعادة الفورية لأي مبالغ جرى تحصيلها نتيجة لهذا الخطأ، حسب الاقتضاء؛ (2) معالجة هذه الأخطاء وتصحيحها لأي عملاء متأثرين في غضون ستين (60) يوم عمل بدءًا من تاريخ تحديد الخطأ؛ و(3) إبلاغكم بهذا الخطأ واتخاذ الإجراءات التصحيحية.

٢١. الاتفاق الكامل:
١.٢١ تمثل هذه الشروط والأحكام، جنبًا إلى جنب مع سياسة الخصوصية وأي شروط أخرى متفق عليها بينكم وبين تمارا من وقت لآخر، مجمل ما جرى الاتفاق عليه فيما بينكم وبين تمارا.

٢.٢١مُوجِبه، أوافق أنا المُوَقِّع أدناه على أن أوفّر لـشركة نخلة لتقنية نظم المعلومات ذ.م.م (تمارا) أيّة معلومات تتطلبها لإنشاء و/أو تدقيق و/أو إدارة حساباتي والتسهيلات بها وأصرح لها بالحصول على أيّة معلومات وجمعها حسبما تراه ضروريًا أو بحاجة إليها فيما يتعلق بي وبحساباتي والتسهيلات ذات الصلة، من الشركة السعودية للمعلومات الائتمانية (سمة) والإفصاح عن هذه المعلومات ومشاركتها (بما في ذلك تجميع البيانات) للشركة المذكورة (سمة) وَفقا لاتفاقية العضوية وقواعد السلوك المعتمدة أو إلى أي وكالة أخرى معتمدة من البنك المركزي السعودي (ساما).''';
}
